---
kind: type
id: T:Autodesk.Revit.DB.Structure.BendingDetailBendDiameterDimensionType
source: html/28a9c40f-0885-295e-01d8-079a294c51e5.htm
---
# Autodesk.Revit.DB.Structure.BendingDetailBendDiameterDimensionType

Describes the dimension type for bend diameter.

## Syntax (C#)
```csharp
public enum BendingDetailBendDiameterDimensionType
```